app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY created_at LIMIT 20
---
  def index
    @products = Product.order('created_at').limit(20)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 5  ORDER BY created_at DESC
---
  def show
    @product = Product.find(params[:id])
    @reviews = @product.reviews.order('created_at DESC')

SELECT  `products`.* FROM `products` WHERE (title LIKE('%美人%')) LIMIT 20
---
  def search
    @search_products = Product.where('title LIKE(?)', "%#{params[:keyword]}%").limit(20)