app/controllers/reviews_controller.rb

  def create
    Review.create(review_params)
---
INSERT INTO `reviews` (`nickname`, `rate`, `review`, `product_id`, `created_at`, `updated_at`) VALUES ('hhs', 1, 'hhs', 1, '2017-04-27 08:39:54', '2017-04-27 08:39:54')